In [ ]:
#Question-1
# Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [ ]:
SELECT RTRIM(FIRST_NAME) FROM Worker;

In [ ]:
#Question-2
# Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [ ]:
SELECT POSITION('a' IN FIRST_NAME) AS Position_of_a FROM Worker WHERE FIRST_NAME = 'Amitabh';

In [ ]:
#Question-3
# Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [ ]:
SELECT SUBSTRING(FIRST_NAME, 1, 3) FROM Worker;

In [ ]:
#Question-4
# Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [ ]:
SELECT DISTINCT DEPARTMENT FROM Worker;

In [ ]:
#Question-5
# Write an SQL query to fetch “FIRST_NAME” from Worker table in upper case.

In [ ]:
SELECT UPPER(FIRST_NAME) FROM Worker;

In [ ]:
#Question-6
# Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>.

In [ ]:
SELECT FIRST_NAME AS WORKER_NAME FROM Worker;

In [ ]:
#Question-7
# Insert values in bonus table like the below:
# Column name: WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES
# Values: (001, 5000, '16-02-20'),
#       (002, 3000, '16-06-11'),
#       (003, 4000, '16-02-20'),
#       (001, 4500, '16-02-20'),
#       (002, 3500, '16-06-11')

In [ ]:
INSERT INTO bonus (WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE)
VALUES
(001, 5000, '16-02-20'),
(002, 3000, '16-06-11'),
(003, 4000, '16-02-20'),
(001, 4500, '16-02-20'),
(002, 3500, '16-06-11');

In [ ]:
#Question-8
# Create a foreign key connection of bonus table with worker table:

In [ ]:
ALTER TABLE bonus
ADD CONSTRAINT fk_bonus_worker
FOREIGN KEY (WORKER_REF_ID) 
REFERENCES worker(WORKER_ID);

In [ ]:
#Question-9
# Insert data in each column of the worker table: 
# Where column name are WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT
# And the values:
# (001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
#        (002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),

In [ ]:
INSERT INTO worker (WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT)
VALUES (001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
       (002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');

In [ ]:
#Question-10
# Create a sample table Worker with column name id, first name, last name, salary, joining date, department.

In [ ]:
CREATE TABLE Worker (
    id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    salary INT,
    joining_date DATE,
    department VARCHAR(50)
);

In [ ]:
#Question-11
# Create a sample table Worker with column name worker_id and worker_id will be not null and make it primary 
# key with auto-increment functionality.

In [ ]:
CREATE TABLE Worker (
  worker_id INT NOT NULL AUTO_INCREMENT,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  salary FLOAT,
  joining_date DATE,
  department VARCHAR(50),
  PRIMARY KEY (worker_id)
);

In [ ]:
#Question-12
# Create a sample table test_table with column name first name and last name with CHAR(25) column type

In [ ]:
CREATE TABLE test_table (
  first_name CHAR(25),
  last_name CHAR(25)
);

In [ ]:
#Question-13
# Write a query to use the database name ekeeda_students

In [ ]:
USE ekeeda_students;

In [ ]:
#Question-14
# Create a database in SQL:

In [ ]:
CREATE DATABASE mydatabase;

In [ ]:
#Question-15
# Write a query to show the available databases

In [ ]:
SHOW DATABASES;